doom/config.org
#+title: Doom Emacs — Life OS Configuration
#+author: Pongpop
#+property: header-args:emacs-lisp :tangle yes :results silent
#+startup: overview

* About this file
:PROPERTIES:
:CUSTOM_ID: about
:END:

This is a *literate configuration* for Doom Emacs. The =:config (literate)=
Doom module auto-tangles this file into =config.el= every time you run =doom
sync=. You should *never edit =config.el= directly* — it is regenerated on
every tangle.

Editing workflow:
1. Open this file (=~/.config/doom/config.org=).
2. Use =C-c '= inside any source block to edit it in a real elisp buffer.
3. Save and exit the block with =C-c '= again.
4. =M-x org-babel-tangle= to regenerate =config.el= immediately, then
   =M-x doom/reload= to apply changes — or run =doom sync= from a shell.

The file-level =#+property: header-args:emacs-lisp :tangle yes= line above
sets tangling as the default for every =emacs-lisp= block, so individual
blocks don't need to repeat =:tangle yes=. A block can opt out with
=:tangle no=.

* Startup
:PROPERTIES:
:CUSTOM_ID: startup
:END:

Open dired on =~/org/= as the first buffer at startup, instead of the
Doom dashboard. =SPC .= and other file-finding commands then default
to =~/org/= since that's the current buffer's directory.

To get the Doom dashboard back, comment out the =initial-buffer-choice=
setting.

#+begin_src emacs-lisp
(setq initial-buffer-choice (lambda () (find-file "~/org/inbox.org")))
#+end_src

* Org base
:PROPERTIES:
:CUSTOM_ID: org-base
:END:

Org directory, agenda files, TODO keywords, archive location, and small
quality-of-life defaults. This is the foundation every other block builds on.

The TODO sequence is:

- =TODO= — not started
- =STRT= — in progress (currently working on)
- =WAIT= — blocked on someone/something
- =DONE= — finished
- =KILL= — dropped (different from DONE; useful for honest reviews)

The =(t/s/w@/!/d!/k@)= keys after each keyword are the single-letter
shortcuts after =C-c C-t=. The =!=/=@= flags log a timestamp / prompt for
a note on state entry.

Archive goes to a =* Archive= heading at the bottom of the same file so
history stays alongside the project for grep and review.

#+begin_src emacs-lisp
;; ──────────────────────────────────────────────────────────
;; Org directory and agenda files
;; ──────────────────────────────────────────────────────────
(setq org-directory "~/org/")

(after! org
  ;; Files that contribute TODOs to the agenda.
  (setq org-agenda-files
        (list (concat org-directory "goals/")
              (concat org-directory "pillars/")
              (concat org-directory "projects/")
              (concat org-directory "daily/")
              (concat org-directory "inbox.org")))

  ;; ────────────────────────────────────────────────────────
  ;; TODO keywords
  ;;   TODO  - not started
  ;;   STRT  - in progress (currently working on)
  ;;   WAIT  - blocked on someone/something
  ;;   DONE  - finished
  ;;   KILL  - dropped (different from done; useful for honest review)
  ;;
  ;; (s/w/d/k/etc.) = single-key shortcut after C-c C-t
  ;; !   = log a timestamp on state entry
  ;; @   = prompt for a note on state entry
  ;; /!  = log timestamp on state EXIT
  ;; ────────────────────────────────────────────────────────
  (setq org-todo-keywords
        '((sequence "TODO(t)" "STRT(s)" "WAIT(w@/!)"
                    "|"
                    "DONE(d!)" "KILL(k@)")))

  ;; Color the state keywords for quick visual scanning.
  ;; Catppuccin Macchiato palette:
  ;;   green   #a6da95   blue   #8aadf4   yellow #eed49f
  ;;   red     #ed8796   overlay0 #6e738d (muted)
  (setq org-todo-keyword-faces
        '(("TODO" . (:foreground "#a6da95" :weight bold))   ; green — to do
          ("STRT" . (:foreground "#8aadf4" :weight bold))   ; blue  — in progress
          ("WAIT" . (:foreground "#eed49f" :weight bold))   ; yellow — blocked
          ("DONE" . (:foreground "#6e738d" :weight normal)) ; muted — out of sight
          ("KILL" . (:foreground "#ed8796" :weight bold)))) ; red — dropped

  ;; Always record a timestamp when marking DONE.
  (setq org-log-done 'time)
  ;; Tuck state-change log entries into a :LOGBOOK: drawer (folded by default).
  (setq org-log-into-drawer t)

  ;; ────────────────────────────────────────────────────────
  ;; Archive
  ;; ────────────────────────────────────────────────────────
  ;; Archive completed tasks to a "* Archive" heading at the bottom
  ;; of the SAME file. Keeps history with the project for grep/review.
  (setq org-archive-location "::* Archive")

  ;; ────────────────────────────────────────────────────────
  ;; Misc quality-of-life
  ;; ────────────────────────────────────────────────────────
  (setq org-startup-folded 'content        ; show headings on open
        org-startup-indented t              ; indent by heading level
        org-hide-emphasis-markers t         ; cleaner inline formatting
        org-pretty-entities t
        org-image-actual-width '(400)
        org-tags-column 0                   ; tags right after heading text
        org-fold-catch-invisible-edits 'smart
        org-ellipsis " ▾"))                 ; folded-heading marker
#+end_src

* Org-roam
:PROPERTIES:
:CUSTOM_ID: org-roam
:END:

Org-roam v2 setup: the relational backbone of the Life OS graph. All roam
nodes live anywhere under =~/org/=; the dailies live in =~/org/daily/=.

The database autosync mode keeps the link graph up to date without manual
=org-roam-db-sync= calls.

#+begin_src emacs-lisp
;; ──────────────────────────────────────────────────────────
;; Org-roam (v2)
;; ──────────────────────────────────────────────────────────
(use-package! org-roam
  :custom
  (org-roam-directory (file-truename "~/org/"))
  (org-roam-dailies-directory "daily/")
  (org-roam-completion-everywhere t)
  ;; Display backlinks etc. in a side window.
  (org-roam-mode-section-functions
   (list #'org-roam-backlinks-section
         #'org-roam-reflinks-section))
  :config
  (org-roam-db-autosync-mode))
#+end_src

