doom/config.el
(setq initial-buffer-choice (lambda () (find-file "~/org/inbox.org")))

;; ──────────────────────────────────────────────────────────
;; Org directory and agenda files
;; ──────────────────────────────────────────────────────────
(setq org-directory "~/org/")

(after! org
  ;; Files that contribute TODOs to the agenda.
  (setq org-agenda-files
        (list (concat org-directory "goals/")
              (concat org-directory "pillars/")
              (concat org-directory "projects/")
              (concat org-directory "daily/")
              (concat org-directory "inbox.org")))

  ;; ────────────────────────────────────────────────────────
  ;; TODO keywords
  ;;   TODO  - not started
  ;;   STRT  - in progress (currently working on)
  ;;   WAIT  - blocked on someone/something
  ;;   DONE  - finished
  ;;   KILL  - dropped (different from done; useful for honest review)
  ;;
  ;; (s/w/d/k/etc.) = single-key shortcut after C-c C-t
  ;; !   = log a timestamp on state entry
  ;; @   = prompt for a note on state entry
  ;; /!  = log timestamp on state EXIT
  ;; ────────────────────────────────────────────────────────
  (setq org-todo-keywords
        '((sequence "TODO(t)" "STRT(s)" "WAIT(w@/!)"
                    "|"
                    "DONE(d!)" "KILL(k@)")))

  ;; Color the state keywords for quick visual scanning.
  ;; Catppuccin Macchiato palette:
  ;;   green   #a6da95   blue   #8aadf4   yellow #eed49f
  ;;   red     #ed8796   overlay0 #6e738d (muted)
  (setq org-todo-keyword-faces
        '(("TODO" . (:foreground "#a6da95" :weight bold))   ; green — to do
          ("STRT" . (:foreground "#8aadf4" :weight bold))   ; blue  — in progress
          ("WAIT" . (:foreground "#eed49f" :weight bold))   ; yellow — blocked
          ("DONE" . (:foreground "#6e738d" :weight normal)) ; muted — out of sight
          ("KILL" . (:foreground "#ed8796" :weight bold)))) ; red — dropped

  ;; Always record a timestamp when marking DONE.
  (setq org-log-done 'time)
  ;; Tuck state-change log entries into a :LOGBOOK: drawer (folded by default).
  (setq org-log-into-drawer t)

  ;; ────────────────────────────────────────────────────────
  ;; Archive
  ;; ────────────────────────────────────────────────────────
  ;; Archive completed tasks to a "* Archive" heading at the bottom
  ;; of the SAME file. Keeps history with the project for grep/review.
  (setq org-archive-location "::* Archive")

  ;; ────────────────────────────────────────────────────────
  ;; Misc quality-of-life
  ;; ────────────────────────────────────────────────────────
  (setq org-startup-folded 'content        ; show headings on open
        org-startup-indented t              ; indent by heading level
        org-hide-emphasis-markers t         ; cleaner inline formatting
        org-pretty-entities t
        org-image-actual-width '(400)
        org-tags-column 0                   ; tags right after heading text
        org-fold-catch-invisible-edits 'smart
        org-ellipsis " ▾"))                 ; folded-heading marker

;; ──────────────────────────────────────────────────────────
;; Org-roam (v2)
;; ──────────────────────────────────────────────────────────
(use-package! org-roam
  :custom
  (org-roam-directory (file-truename "~/org/"))
  (org-roam-dailies-directory "daily/")
  (org-roam-completion-everywhere t)
  ;; Display backlinks etc. in a side window.
  (org-roam-mode-section-functions
   (list #'org-roam-backlinks-section
         #'org-roam-reflinks-section))
  :config
  (org-roam-db-autosync-mode))

;; ──────────────────────────────────────────────────────────
