doom/config.org
* Roam capture templates (PPV + Vault)
:PROPERTIES:
:CUSTOM_ID: roam-captures
:END:

Templates for capturing Value Goals, Pillars, Projects, Concepts, Literature
notes, Fleeting notes, and Meeting notes via =SPC n c=.

Hierarchy is enforced via =:filetags:= and an explicit Pillar/Goal link in
the new file body — the user is prompted for the parent at capture time,
so the link is always there from the start.

| Key | Template          | Folder                 |
|-----+-------------------+------------------------|
| g   | Value Goal        | goals/                 |
| p   | Pillar            | pillars/               |
| r   | Project           | projects/              |
| c   | Concept (perm.)   | knowledge/concepts/    |
| l   | Literature        | knowledge/literature/  |
| f   | Fleeting          | knowledge/fleeting/    |
| m   | Meeting           | meetings/              |

#+begin_src emacs-lisp
;; ──────────────────────────────────────────────────────────
;; Helper: prompt for a roam node filtered by tag, return [[id:..]] link.
;;
;; Used inside the capture templates below via %(...) so capture-time
;; produces a real org-roam link (not just plain text). Backlinks pick
;; the new node up automatically once captured.
;;
;; If no nodes with the requested tag exist yet (e.g. capturing the
;; very first Pillar before any Goal exists), it inserts an empty
;; string rather than erroring — you can add the link later with
;; SPC n r i.
;; ──────────────────────────────────────────────────────────
(defun life-os/roam-link-by-tag (tag)
  "Prompt for a roam node tagged TAG and return its [[id:..]] link string."
  (require 'cl-lib)
  (let* ((nodes (cl-remove-if-not
                 (lambda (n) (member tag (org-roam-node-tags n)))
                 (org-roam-node-list)))
         (titles (mapcar #'org-roam-node-title nodes)))
    (if (null nodes)
        (progn
          (message "No org-roam nodes tagged :%s: yet — link later with SPC n r i." tag)
          "")
      (let* ((choice (completing-read (format "Linked %s: " tag)
                                      titles nil t))
             (node (cl-find choice nodes
                            :key #'org-roam-node-title
                            :test #'equal)))
        (if node
            (format "[[id:%s][%s]]"
                    (org-roam-node-id node)
                    (org-roam-node-title node))
          "")))))

;; ──────────────────────────────────────────────────────────
;; Roam capture templates
;;
;; Hierarchy enforced via :filetags and an explicit parent link in
;; the new file. The user picks the parent at capture time via the
;; life-os/roam-link-by-tag helper above.
;; ──────────────────────────────────────────────────────────
(after! org-roam
  (setq org-roam-capture-templates
        '(("g" "Value Goal" plain
           "%?"
           :target (file+head "goals/${slug}.org"
                              "#+title: ${title}\n#+filetags: :goal:\n\n* Why this matters\n\n* Pillars supporting this goal\n")
           :unnarrowed t)

          ("p" "Pillar" plain
           "%?"
           :target (file+head "pillars/${slug}.org"
                              "#+title: ${title}\n#+filetags: :pillar:\n\n* Value goal\n%(life-os/roam-link-by-tag \"goal\")\n\n* Guiding principles\n\n* Projects\n\n* Pillar-level tasks\n")
           :unnarrowed t)

          ("r" "Project" plain
           "%?"
           :target (file+head "projects/${slug}.org"
                              "#+title: ${title}\n#+filetags: :project:\n\n* Pillar\n%(life-os/roam-link-by-tag \"pillar\")\n\n* Definition of done\n\n* Tasks\n\n* Notes\n")
           :unnarrowed t)

          ("c" "Concept (permanent note)" plain
           "%?"
           :target (file+head "knowledge/concepts/${slug}.org"
                              "#+title: ${title}\n#+filetags: :concept:\n")
           :unnarrowed t)

          ("l" "Literature note" plain
           "%?"
           :target (file+head "knowledge/literature/${slug}.org"
                              "#+title: ${title}\n#+filetags: :literature:\n\n* Source\n\n* Key ideas\n\n* My takeaways\n")
           :unnarrowed t)

          ("f" "Fleeting note" plain
           "%?"
           :target (file+head "knowledge/fleeting/${slug}.org"
                              "#+title: ${title}\n#+filetags: :fleeting:\n")
           :unnarrowed t)

          ("m" "Meeting note" plain
           "%?"
           :target (file+head "meetings/%<%Y-%m-%d>-${slug}.org"
                              "#+title: ${title}\n#+filetags: :meeting:\n#+date: %<%Y-%m-%d>\n\n* Attendees\n\n* Agenda\n\n* Decisions\n\n* Action items\n")
           :unnarrowed t))))

;; ──────────────────────────────────────────────────────────
;; Fix: keep the roam :ID: drawer at the TOP of new files.
;;
;; THE CROSS-MACHINE DISCREPANCY (CLAUDE.md). On a brand-new
;; `file+head' capture, org-roam sets its insert point to
;; (point-max) — see org-roam-capture--setup-target-location, the
;; `(setq p (point-max))' line. For our templates that end with
;; headings (Goal/Pillar/Project/Literature/Meeting), point-max sits
;; *inside the last subtree*, so `org-entry-put' drops the :ID: into
;; that last heading — i.e. the bottom of the file. Templates with no
;; headings (Concept/Fleeting) land at the top by luck. Win11 puts it
;; at the top (older org-roam where p was point-min), hence the split.
;;
;; A second flavour of the same bug bites the dailies (SPC n r d …).
;; Those use an `entry'-type template, and for entry captures org-roam
;; stamps a *fresh* :ID: on the new `* HH:MM' heading every single time
;; (via org-roam-capture--create-id-for-entry) — so each daily capture
;; appends yet another ID at the bottom and every log line becomes its
;; own node. We want the day FILE to be the one node and the timestamp
;; lines to stay plain.
;;
;; Shared fix below: `life-os/roam-lift-id-to-top' cuts a stray ":ID:"
;; line from wherever org-roam left it and re-creates it as a single
;; file-level drawer at the very top. Two hooks call it — one for
;; ordinary file nodes (only on a brand-new file) and one for dailies
;; (every capture, to strip the per-entry ID). Both are idempotent: a
;; no-op when the ID is already up top, so they're safe on both
;; machines and survive a future `doom upgrade'.
;; ──────────────────────────────────────────────────────────
(defun life-os/roam-lift-id-to-top (id)
  "Ensure ID lives in a file-level :PROPERTIES: drawer at the top.
Cut any stray `:ID: ID' line org-roam left below the first heading
(plus its emptied drawer) and re-create ID at the file level.  A
no-op when ID is already the top-level file ID."
  (when (and id (derived-mode-p 'org-mode))
    (org-with-wide-buffer
     (unless (equal id (org-entry-get (point-min) "ID"))
       ;; Cut the stray ":ID: <id>" line wherever org-roam put it…
       (goto-char (point-min))
       (when (re-search-forward
              (format "^[ \t]*:ID:[ \t]+%s[ \t]*\n" (regexp-quote id))
              nil t)
         (let ((beg (match-beginning 0)))
           (delete-region beg (match-end 0))
           ;; …and tidy the now-empty :PROPERTIES:/:END: pair.
           (save-excursion
             (goto-char beg)
             (forward-line -1)
             (when (looking-at-p
                    "^[ \t]*:PROPERTIES:[ \t]*\n[ \t]*:END:[ \t]*\n")
               (delete-region (point) (progn (forward-line 2) (point)))))))
       ;; …then (re-)create it as a file-level property at the top,
       ;; unless the file already carries one (later dailies captures).
       (unless (org-entry-get (point-min) "ID")
         (org-entry-put (point-min) "ID" id))))))

(defun life-os/roam-dailies-buffer-p ()
  "Non-nil when the current buffer's file lives under the dailies dir."
  (when-let* ((file (buffer-file-name (buffer-base-buffer)))
              (dir (and (bound-and-true-p org-roam-dailies-directory)
                        (expand-file-name org-roam-dailies-directory
                                          org-roam-directory))))
    (file-in-directory-p file dir)))

(defun life-os/roam-id-to-top ()
  "Hoist a brand-new *file* node's :ID: to a top-level drawer."
  (when (and (org-roam-capture--get :new-file)     ; only brand-new files
             (not (life-os/roam-dailies-buffer-p))); dailies handled below
    (life-os/roam-lift-id-to-top
     (org-roam-node-id org-roam-capture--node))))

(defun life-os/roam-daily-file-as-node ()
  "Keep ONE :ID: on the day file instead of one per dailies entry.
Strips the per-entry ID org-roam just stamped and ensures a single
file-level ID up top, so the day is the node and the timestamp lines
stay plain."
  (when (life-os/roam-dailies-buffer-p)
    (life-os/roam-lift-id-to-top
     (org-roam-node-id org-roam-capture--node))))

(after! org-roam
  (add-hook 'org-roam-capture-new-node-hook #'life-os/roam-id-to-top)
  (add-hook 'org-roam-capture-new-node-hook #'life-os/roam-daily-file-as-node))
#+end_src

