doom/config.org
* Standard capture templates (inbox, quick tasks, dailies)
:PROPERTIES:
:CUSTOM_ID: standard-captures
:END:

Non-roam =org-capture= templates: inbox tasks, someday/maybe items, project
notes, and the daily journal.

These are separate from the org-roam capture templates (which create new
PPV nodes). These templates write into existing files (=inbox.org=,
=someday.org=, a chosen project) or into the org-roam dailies file for
today.

#+begin_src emacs-lisp
;; ──────────────────────────────────────────────────────────
;; org-capture templates (non-roam)
;; ──────────────────────────────────────────────────────────
(after! org
  (setq org-capture-templates
        '(;; ── Inbox: one-off tasks, route during weekly review
          ("i" "Inbox task" entry
           (file "~/org/inbox.org")
           "* TODO %?\n  :PROPERTIES:\n  :CAPTURED: %U\n  :END:\n  %i"
           :empty-lines 1)

          ;; ── Someday/maybe
          ("s" "Someday / Maybe" entry
           (file "~/org/someday.org")
           "* %?\n  :PROPERTIES:\n  :CAPTURED: %U\n  :END:"
           :empty-lines 1)

          ;; ── Quick note into a project (prompts for project file)
          ("n" "Note under existing file" entry
           (file+headline (lambda ()
                            (read-file-name "Project file: "
                                            (concat org-directory "projects/")))
                          "Notes")
           "* %?\n  %U"
           :empty-lines 1)

          ;; ── Reviews are appended in the Review block below
          )))

;; ──────────────────────────────────────────────────────────
;; Org-roam dailies capture
;;
;; Single template only → org-capture skips the template-selection
;; menu and drops straight into the capture buffer. Add any tags
;; yourself in the entry body.
;; ──────────────────────────────────────────────────────────
(after! org-roam
  (setq org-roam-dailies-capture-templates
        '(("d" "default" entry
           "* %<%H:%M> %?"
           :target (file+head "%<%Y-%m-%d>.org"
                              "#+title: %<%Y-%m-%d %A>\n#+filetags: :daily:\n")))))
#+end_src

* Super-agenda groups
:PROPERTIES:
:CUSTOM_ID: super-agenda
:END:

How tasks are grouped inside the agenda views: overdue, today, in-progress,
waiting, inbox, upcoming, then auto-grouped by project.

Order of groups matters — earlier groups claim tasks first. =:auto-category=
at the end buckets everything remaining by its file (project) name.

#+begin_src emacs-lisp
;; ──────────────────────────────────────────────────────────
;; Org-super-agenda — daily dashboard grouping
;; ──────────────────────────────────────────────────────────
(use-package! org-super-agenda
  :after org-agenda
  :init
  (setq org-super-agenda-groups
        '((:name "🔥 Overdue"
           :and (:scheduled past :not (:todo ("DONE" "KILL"))))
          (:name "📅 Today"
           :time-grid t
           :scheduled today)
          (:name "▶ In progress"
           :todo "STRT")
          (:name "⏸ Waiting on"
           :todo "WAIT")
          (:name "📥 Inbox"
           :file-path "inbox\\.org")
          (:name "🗓 Upcoming this week"
           :scheduled future
           :order 90)
          ;; Everything else: group by category (= filename = project)
          (:auto-category t
           :order 100)))
  :config
  (org-super-agenda-mode))
#+end_src

* Custom agenda commands (review dashboards)
:PROPERTIES:
:CUSTOM_ID: agenda-commands
:END:

Daily / Weekly / Monthly / Quarterly / Annual dashboards bound to =SPC A= keys.

| Key | Dashboard | Typical duration |
|-----+-----------+------------------|
| D   | Daily     | ~5 min           |
| W   | Weekly    | ~45–60 min       |
| M   | Monthly   | ~60–90 min       |
| Q   | Quarterly | ~2–3 hr          |
| Y   | Annual    | ~half day        |

Each is a composite agenda view that combines an =agenda= block (a date
range) with one or more =todo= or =tags= filters. The keybindings in
Section 9.3.10 wrap each in a =cmd!= for =SPC A= access.

#+begin_src emacs-lisp
;; ──────────────────────────────────────────────────────────
;; Custom agenda commands
;;
;; D = Daily dashboard           (~5 min review)
;; W = Weekly dashboard          (~45–60 min)
;; M = Monthly dashboard         (~60–90 min)
;; Q = Quarterly dashboard       (~2–3 hr)
;; Y = Annual dashboard          (~half day)
;;
;; GOTCHA: Doom sets a GLOBAL `org-agenda-start-day' of "-3d", so any
;; `agenda' block that omits it starts 3 days early (Daily showed the
;; 29th, not today). Every block below sets it explicitly; nil = today.
;; Full story in CLAUDE.md → "Gotchas".
;; ──────────────────────────────────────────────────────────
(after! org-agenda
  (setq org-agenda-custom-commands
        '(("D" "Daily dashboard"
           ((agenda ""
                    ((org-agenda-span 1)
                     (org-agenda-start-day nil)   ; today (not Doom's -3d)
                     (org-agenda-start-with-log-mode '(closed clock state))
                     (org-agenda-overriding-header "📅 TODAY")))
            (todo "STRT"
                  ((org-agenda-overriding-header "▶ In progress")))
            (todo "WAIT"
                  ((org-agenda-overriding-header "⏸ Waiting on")))
            (tags "inbox"
                  ((org-agenda-files (list (concat org-directory "inbox.org")))
                   (org-agenda-overriding-header "📥 Inbox")))))

          ("W" "Weekly dashboard"
           ((agenda ""
                    ((org-agenda-span 7)
                     (org-agenda-start-day "-7d")  ; the 7 days ending yesterday
                     (org-agenda-start-with-log-mode '(closed))
                     (org-agenda-overriding-header "📊 PAST WEEK")))
            (agenda ""
                    ((org-agenda-span 7)
                     (org-agenda-start-day nil)    ; today + next 6 days (was "+1d",
                                                   ; which skipped today entirely)
                     (org-agenda-overriding-header "🔮 NEXT 7 DAYS")))
            (todo "STRT|WAIT"
                  ((org-agenda-overriding-header "▶/⏸ Active and Blocked")))))

          ("M" "Monthly dashboard"
           ((agenda ""
                    ((org-agenda-span 'month)
                     (org-agenda-start-day "-1m")
                     (org-agenda-start-with-log-mode '(closed))
                     (org-agenda-overriding-header "📊 PAST MONTH")))
            (todo "TODO|STRT|WAIT"
                  ((org-agenda-overriding-header "🗂 All open work")))))

          ("Q" "Quarterly dashboard"
           ((agenda ""
                    ((org-agenda-span 90)
                     (org-agenda-start-day "-90d")
                     (org-agenda-start-with-log-mode '(closed))
                     (org-agenda-overriding-header "📊 PAST QUARTER")))
            (tags "+fleeting"
                  ((org-agenda-overriding-header "💭 Fleeting notes to process")))))

          ("Y" "Annual dashboard"
           ((agenda ""
                    ((org-agenda-span 365)
                     (org-agenda-start-day "-365d")
                     (org-agenda-start-with-log-mode '(closed))
                     (org-agenda-overriding-header "📊 PAST YEAR")))))

          ;; Quick access to the default unified agenda
          ("a" "All TODOs grouped"
           ((todo "TODO|STRT|WAIT"))))))
#+end_src

