doom/config.org
* Calfw (calendar grid view)
:PROPERTIES:
:CUSTOM_ID: calfw
:END:

Month-grid calendar populated from org-agenda. Bound to =SPC o c=.

Note: the current calfw fork on MELPA renamed its public API from the
=cfw:= prefix to =calfw-=. We use the new names. =calfw-compat= still
provides obsolete aliases for the old =cfw:= names.

#+begin_src emacs-lisp
;; ──────────────────────────────────────────────────────────
;; Calfw — month-grid calendar populated from org-agenda
;;
;; Entry point: M-x calfw-org-open-calendar (bound to SPC o c in Phase 7).
;;
;; In the calendar buffer:
;;   n / p          next / previous day
;;   N / P          next / previous week
;;   M-n / M-p      next / previous month
;;   t              jump to today
;;   RET            jump to the org file/heading under cursor
;;   q              quit
;; ──────────────────────────────────────────────────────────
(use-package! calfw
  :commands (calfw-open-calendar-buffer))

(use-package! calfw-org
  ;; Note: do NOT add :after calfw here. Doing so defers Doom's autoload
  ;; setup for these commands until calfw is loaded, which means
  ;; M-x calfw-org-open-calendar (and the SPC o c binding) won't work
  ;; until something else loads calfw first. calfw-org.el itself does
  ;; (require 'calfw) at its top, so the dependency is handled.
  :commands (calfw-org-open-calendar
             calfw-org-create-source)
  :config
  ;; Let calfw-org's own keybindings win in org buffers reached from the cal.
  (setq calfw-org-overwrite-default-keybinding t))

;; Nicer Unicode box-drawing characters for the calendar grid.
;; Defaults are ASCII (+, -, |) which look noisy. These render as
;; smooth heavy lines in any decent monospace font.
(after! calfw
  (setq calfw-fchar-junction         ?╋
        calfw-fchar-vertical-line    ?┃
        calfw-fchar-horizontal-line  ?━
        calfw-fchar-left-junction    ?┣
        calfw-fchar-right-junction   ?┫
        calfw-fchar-top-junction     ?┯
        calfw-fchar-top-left-corner  ?┏
        calfw-fchar-top-right-corner ?┓))

;; ──────────────────────────────────────────────────────────
;; Calfw faces — Catppuccin Macchiato
;;
;; Out of the box calfw uses hard primary blues/reds that clash with
;; the Catppuccin theme. Remap every calfw face to the Macchiato
;; palette so the calendar matches the rest of Emacs.
;;
;; Palette (Macchiato):
;;   base    #24273a   surface0 #363a4f   surface1 #494d64
;;   overlay0 #6e738d  subtext0 #a5adcb   text     #cad3f5
;;   blue    #8aadf4   lavender #b7bdf8    teal     #8bd5ca
;;   green   #a6da95   yellow   #eed49f    peach    #f5a97f
;;   red     #ed8796   mauve    #c6a0f6
;;
;; custom-set-faces! is applied after the theme loads, so these win.
;; ──────────────────────────────────────────────────────────
(custom-set-faces!
  ;; Big month title at the top.
  '(calfw-title-face        :foreground "#c6a0f6" :weight bold :height 2.0)
  ;; Weekday header row (Mon Tue Wed …).
  '(calfw-header-face       :foreground "#b7bdf8" :weight bold)
  ;; Weekend column tints.
  '(calfw-sunday-face       :foreground "#ed8796" :weight bold)
  '(calfw-saturday-face     :foreground "#8aadf4" :weight bold)
  '(calfw-holiday-face      :foreground "#f5a97f")
  ;; The box-drawing grid — keep it quiet so events stand out.
  '(calfw-grid-face         :foreground "#494d64")
  ;; Day number in each cell, and event/period content.
  '(calfw-day-title-face    :foreground "#a5adcb")
  '(calfw-default-day-face  :foreground "#cad3f5" :weight bold)
  ;; Event text: neutral (the time prefix is the accent — see transformer below).
  '(calfw-default-content-face :foreground "#cad3f5")
  '(calfw-periods-face      :foreground "#8bd5ca")
  ;; Today: subtle surface highlight + a solid blue day number.
  '(calfw-today-face        :background "#363a4f")
  '(calfw-today-title-face  :foreground "#24273a" :background "#8aadf4" :weight bold)
  ;; Days spilling in from adjacent months, annotations, toolbar.
  '(calfw-disable-face      :foreground "#6e738d")
  '(calfw-annotation-face   :foreground "#8087a2")
  '(calfw-toolbar-face            :foreground "#6e738d" :background "#1e2030")
  '(calfw-toolbar-button-off-face :foreground "#6e738d")
  '(calfw-toolbar-button-on-face  :foreground "#8aadf4" :weight bold))

;; ──────────────────────────────────────────────────────────
;; No background "blob" on entries
;;
;; calfw colors each agenda item with its SOURCE color (default
;; "Seagreen4"), compositing it into a faint :foreground AND
;; :background — the green text + green blob behind every entry.
;;
;; We can't just pass a nil source color: the periods code path
;; (`calfw--source-period-bgcolor-get') feeds the color straight to
;; `color-name-to-rgb', so nil crashes rendering. Instead, override
;; the two face-deriving functions to ignore the source color and
;; return the plain DEFAULT-FACE the callers already pass
;; (`calfw-default-content-face' / `calfw-periods-face' — both styled
;; above). Result: theme-coherent text, no source-derived colors.
;; ──────────────────────────────────────────────────────────
(after! calfw
  (defadvice! life-os/calfw-plain-content-face (_text default-face)
    "Ignore the per-source color; use the plain content face (no bg blob)."
    :override #'calfw--render-get-face-content
    default-face)

  (defadvice! life-os/calfw-plain-period-face (_text default-face)
    "Ignore the per-source color; use the plain period face."
    :override #'calfw--render-get-face-period
    default-face))

;; ──────────────────────────────────────────────────────────
;; Accent the time
;;
;; calfw-org prefixes timed entries with "HH:MM " but leaves it the
;; same face as the rest of the entry. Wrap the default formatter and
;; tint that leading time peach + bold so the start time pops.
;; ──────────────────────────────────────────────────────────
(defun life-os/calfw-org-summary-format (item)
  "Like `calfw-org-summary-format', but accent the leading HH:MM time."
  (let ((line (calfw-org-summary-format item)))
    (when (and (stringp line)
               (string-match "\\`[0-9]\\{2\\}:[0-9]\\{2\\} " line))
      (add-face-text-property (match-beginning 0) (match-end 0)
                              '(:foreground "#f5a97f" :weight bold) ; peach
                              nil line))
    line))

(after! calfw-org
  (setq calfw-org-schedule-summary-transformer
        #'life-os/calfw-org-summary-format))

;; ──────────────────────────────────────────────────────────
;; Evil — let calfw's single-key navigation through
;;
;; `calfw-calendar-mode' is a hand-rolled major mode (NOT
;; define-derived-mode): it sets `major-mode' by hand and only runs
;; its own `calfw-calendar-mode-hook', never `after-change-major-
;; mode-hook'. So evil never initializes a sensible state for it,
;; falls back to normal state, and its keymap shadows calfw's
;; single-key bindings (n p N P d w m t g q) — the buffer feels
;; frozen. (Whether evil-collection happens to patch this is load-
;; order luck, which is why it bites on Linux but not Windows.)
;;
;; Force the buffer into evil "emacs" state so every key reaches
;; calfw's own keymap. `evil-set-initial-state' covers any later
;; re-initialization; the hook covers the initial open.
;; ──────────────────────────────────────────────────────────
(after! calfw
  (evil-set-initial-state 'calfw-calendar-mode 'emacs)
  (add-hook 'calfw-calendar-mode-hook #'evil-emacs-state)

  ;; ────────────────────────────────────────────────────────
  ;; Fit the grid to the full window width on open
  ;;
  ;; calfw sizes the grid from the window at *creation* time, before
  ;; switch-to-buffer has grown the window to full width — so it opens
  ;; at ~2/3 width until you press `g'. Re-render once on the next idle
  ;; tick, when the window has settled at its final size.
  ;;
  ;; NOTE: the buffer is passed as a *timer argument*, not captured in
  ;; a closure — config.el is tangled without a lexical-binding cookie,
  ;; so a closed-over `buf' would be void at timer time.
  ;; ────────────────────────────────────────────────────────
  (defadvice! life-os/calfw-fit-to-window (&rest _)
    "Refresh the calendar after the window reaches its final width."
    :after #'calfw-open-calendar-buffer
    (run-with-idle-timer
     0 nil
     (lambda (b)
       (when (and (buffer-live-p b)
                  (eq (buffer-local-value 'major-mode b) 'calfw-calendar-mode))
         (with-current-buffer b
           (calfw-refresh-calendar-buffer nil))))
     (current-buffer))))

;; ──────────────────────────────────────────────────────────
;; Pre-build agenda buffers before opening calfw
;;
;; calfw-org warns "open org-agenda buffer first" and skips TODO-
;; keyword fontification when `org-todo-keywords-for-agenda' is unset
;; — which it is until org-agenda has been built once. Populate it up
;; front so the calendar colors TODO keywords and the warning is gone.
;; ──────────────────────────────────────────────────────────
(defadvice! life-os/calfw-prep-agenda (&rest _)
  "Populate `org-todo-keywords-for-agenda' before calfw renders."
  :before #'calfw-org-open-calendar
  (org-agenda-prepare-buffers (org-agenda-files)))
#+end_src

