doom/config.org
* Review capture templates
:PROPERTIES:
:CUSTOM_ID: review-captures
:END:

Helpers for the multi-cadence review system: weekly / monthly / quarterly /
annual. Each command creates a dated file under =~/org/reviews/<period>/=
from a template in =~/.config/doom/templates/= if the file does not yet
exist, otherwise just opens the existing file. *Idempotent* — re-running
on the same day during the same week / month / quarter / year does not
duplicate the template body.

Deviation from PRD §9.3.8: the PRD wired reviews through =org-capture=,
which appends the template body on every invocation (so opening the same
weekly review twice produces two stacked copies of the structure).
Replacing with a small "find-or-create" helper avoids that bug.

#+begin_src emacs-lisp
;; ──────────────────────────────────────────────────────────
;; Review system — find-or-create review files from templates
;; ──────────────────────────────────────────────────────────

(defun life-os/--current-quarter ()
  "Return the calendar quarter (1–4) for today as an integer."
  (1+ (/ (1- (string-to-number (format-time-string "%m"))) 3)))

(defun life-os/--make-review-file (file template-name &optional extra-subs)
  "Create FILE from ~/.config/doom/templates/TEMPLATE-NAME if missing.
Expands org-style =%<...>= time codes. EXTRA-SUBS is an alist of
=(literal . replacement)= pairs applied after time expansion (used to
substitute =%q= for the current quarter, since =%q= is not a valid
=format-time-string= code)."
  (unless (file-exists-p file)
    (make-directory (file-name-directory file) t)
    (let ((tmpl (expand-file-name template-name "~/.config/doom/templates/")))
      (with-temp-file file
        (insert-file-contents tmpl)
        ;; Expand %<...> format-time-string codes.
        (goto-char (point-min))
        (while (re-search-forward "%<\\([^>]+\\)>" nil t)
          (replace-match (format-time-string (match-string 1)) t t))
        ;; Apply any extra literal substitutions.
        (dolist (sub extra-subs)
          (goto-char (point-min))
          (while (search-forward (car sub) nil t)
            (replace-match (cdr sub) t t)))))))

(defun life-os/open-weekly-review ()
  "Open this ISO week's review file, creating from template if missing."
  (interactive)
  (let ((file (expand-file-name
               (format-time-string "~/org/reviews/weekly/%Y-W%V.org"))))
    (life-os/--make-review-file file "weekly-review.org")
    (find-file file)))

(defun life-os/open-monthly-review ()
  "Open this month's review file, creating from template if missing."
  (interactive)
  (let ((file (expand-file-name
               (format-time-string "~/org/reviews/monthly/%Y-%m.org"))))
    (life-os/--make-review-file file "monthly-review.org")
    (find-file file)))

(defun life-os/open-quarterly-review ()
  "Open this quarter's review file, creating from template if missing."
  (interactive)
  (let* ((q (life-os/--current-quarter))
         (qs (number-to-string q))
         (file (expand-file-name
                (format "~/org/reviews/quarterly/%s-Q%s.org"
                        (format-time-string "%Y") qs))))
    (life-os/--make-review-file file "quarterly-review.org"
                                `(("%q" . ,qs)))
    (find-file file)))

(defun life-os/open-annual-review ()
  "Open this year's review file, creating from template if missing."
  (interactive)
  (let ((file (expand-file-name
               (format-time-string "~/org/reviews/annual/%Y.org"))))
    (life-os/--make-review-file file "annual-review.org")
    (find-file file)))
#+end_src

* Keybindings
:PROPERTIES:
:CUSTOM_ID: keybindings
:END:

Custom leader-key bindings.

| Binding | Action |
|-------+----------------------------------------|
| =SPC o c= | Open calfw month calendar |
| =SPC A D= | Daily dashboard |
| =SPC A W= | Weekly dashboard |
| =SPC A M= | Monthly dashboard |
| =SPC A Q= | Quarterly dashboard |
| =SPC A Y= | Annual dashboard |
| =SPC X i= | Capture inbox task |
| =SPC X s= | Capture someday/maybe |
| =SPC X w= | Open weekly review |
| =SPC X m= | Open monthly review |
| =SPC X q= | Open quarterly review |
| =SPC X y= | Open annual review |

Note: defining =SPC X= as a prefix-map shadows Doom's default
=SPC X= → =org-capture= single binding. The full =org-capture= menu
is still reachable via =M-x org-capture= or =C-c c=.

#+begin_src emacs-lisp
;; ──────────────────────────────────────────────────────────
;; Leader-key bindings — Life OS
;; ──────────────────────────────────────────────────────────
;; ──────────────────────────────────────────────────────────
;; Agenda navigation — force j/k to mean "down/up" everywhere in the
;; agenda, including on org-super-agenda section header lines.
;;
;; Super-agenda sets `org-super-agenda-header-map' as a `keymap' /
;; `local-map' text property on each group header (e.g. "📥 Inbox").
;; That map is a copy of `org-agenda-mode-map' where j = goto-date,
;; k = capture — and because text-property keymaps win over buffer-
;; local evil bindings, j/k stop being motion keys when point is on
;; a header. We rebind both in that map, plus in the regular agenda
;; map for completeness.
;; ──────────────────────────────────────────────────────────
(map! :map org-agenda-mode-map
      :nm "j" #'org-agenda-next-line
      :nm "k" #'org-agenda-previous-line)

(after! org-super-agenda
  (define-key org-super-agenda-header-map "j" #'org-agenda-next-line)
  (define-key org-super-agenda-header-map "k" #'org-agenda-previous-line))

(map! :leader
      ;; Calendar — bind SPC o c directly (simpler than :prefix wrapper).
      :desc "Calfw month calendar" "o c" #'calfw-org-open-calendar

      ;; Custom agenda dashboards
      (:prefix-map ("A" . "agenda dashboards")
       :desc "Daily"     "D" (cmd! (org-agenda nil "D"))
       :desc "Weekly"    "W" (cmd! (org-agenda nil "W"))
       :desc "Monthly"   "M" (cmd! (org-agenda nil "M"))
       :desc "Quarterly" "Q" (cmd! (org-agenda nil "Q"))
       :desc "Annual"    "Y" (cmd! (org-agenda nil "Y")))

      ;; Captures (X for eXpress capture, to avoid collision with notes)
      (:prefix-map ("X" . "capture")
       :desc "Inbox task"        "i" (cmd! (org-capture nil "i"))
       :desc "Someday / maybe"   "s" (cmd! (org-capture nil "s"))
       :desc "Weekly review"     "w" #'life-os/open-weekly-review
       :desc "Monthly review"    "m" #'life-os/open-monthly-review
       :desc "Quarterly review"  "q" #'life-os/open-quarterly-review
       :desc "Annual review"     "y" #'life-os/open-annual-review))
#+end_src

* Org writing experience
:PROPERTIES:
:CUSTOM_ID: org-writing
:END:

Make org buffers feel more like a writing app: no line numbers, text
centered with comfortable margins via Olivetti.

- =olivetti-body-width 100= gives a ~100-column-wide content column,
  with extra width centered as empty margin. Adjust to taste (an
  integer = columns, a float = fraction of frame width).
- Line numbers off for both =org-mode= and =org-agenda-mode= since
  they're noise in prose / dashboard views.

#+begin_src emacs-lisp
;; ──────────────────────────────────────────────────────────
;; Olivetti — centered writing column for org buffers
;; ──────────────────────────────────────────────────────────
(use-package! olivetti
  :hook (org-mode . olivetti-mode)
  :init
  (setq-default olivetti-body-width 0.65        ; 65% of frame width
                olivetti-minimum-body-width 80  ; never narrower than this
                olivetti-style nil))

;; ──────────────────────────────────────────────────────────
;; Disable line numbers in org-mode and the agenda.
;; Doom's global default is `t`; this overrides for those modes only.
;; ──────────────────────────────────────────────────────────
(add-hook! '(org-mode-hook org-agenda-mode-hook)
  (defun life-os/disable-line-numbers ()
    (display-line-numbers-mode -1)))
#+end_src

