doom/config.el
;; Review system — find-or-create review files from templates
;; ──────────────────────────────────────────────────────────

(defun life-os/--current-quarter ()
  "Return the calendar quarter (1–4) for today as an integer."
  (1+ (/ (1- (string-to-number (format-time-string "%m"))) 3)))

(defun life-os/--make-review-file (file template-name &optional extra-subs)
  "Create FILE from ~/.config/doom/templates/TEMPLATE-NAME if missing.
Expands org-style =%<...>= time codes. EXTRA-SUBS is an alist of
=(literal . replacement)= pairs applied after time expansion (used to
substitute =%q= for the current quarter, since =%q= is not a valid
=format-time-string= code)."
  (unless (file-exists-p file)
    (make-directory (file-name-directory file) t)
    (let ((tmpl (expand-file-name template-name "~/.config/doom/templates/")))
      (with-temp-file file
        (insert-file-contents tmpl)
        ;; Expand %<...> format-time-string codes.
        (goto-char (point-min))
        (while (re-search-forward "%<\\([^>]+\\)>" nil t)
          (replace-match (format-time-string (match-string 1)) t t))
        ;; Apply any extra literal substitutions.
        (dolist (sub extra-subs)
          (goto-char (point-min))
          (while (search-forward (car sub) nil t)
            (replace-match (cdr sub) t t)))))))

(defun life-os/open-weekly-review ()
  "Open this ISO week's review file, creating from template if missing."
  (interactive)
  (let ((file (expand-file-name
               (format-time-string "~/org/reviews/weekly/%Y-W%V.org"))))
    (life-os/--make-review-file file "weekly-review.org")
    (find-file file)))

(defun life-os/open-monthly-review ()
  "Open this month's review file, creating from template if missing."
  (interactive)
  (let ((file (expand-file-name
               (format-time-string "~/org/reviews/monthly/%Y-%m.org"))))
    (life-os/--make-review-file file "monthly-review.org")
    (find-file file)))

(defun life-os/open-quarterly-review ()
  "Open this quarter's review file, creating from template if missing."
  (interactive)
  (let* ((q (life-os/--current-quarter))
         (qs (number-to-string q))
         (file (expand-file-name
                (format "~/org/reviews/quarterly/%s-Q%s.org"
                        (format-time-string "%Y") qs))))
    (life-os/--make-review-file file "quarterly-review.org"
                                `(("%q" . ,qs)))
    (find-file file)))

(defun life-os/open-annual-review ()
  "Open this year's review file, creating from template if missing."
  (interactive)
  (let ((file (expand-file-name
               (format-time-string "~/org/reviews/annual/%Y.org"))))
    (life-os/--make-review-file file "annual-review.org")
    (find-file file)))

;; ──────────────────────────────────────────────────────────
;; Leader-key bindings — Life OS
;; ──────────────────────────────────────────────────────────
;; ──────────────────────────────────────────────────────────
;; Agenda navigation — force j/k to mean "down/up" everywhere in the
;; agenda, including on org-super-agenda section header lines.
;;
;; Super-agenda sets `org-super-agenda-header-map' as a `keymap' /
;; `local-map' text property on each group header (e.g. "📥 Inbox").
;; That map is a copy of `org-agenda-mode-map' where j = goto-date,
;; k = capture — and because text-property keymaps win over buffer-
;; local evil bindings, j/k stop being motion keys when point is on
;; a header. We rebind both in that map, plus in the regular agenda
;; map for completeness.
;; ──────────────────────────────────────────────────────────
(map! :map org-agenda-mode-map
      :nm "j" #'org-agenda-next-line
      :nm "k" #'org-agenda-previous-line)

(after! org-super-agenda
  (define-key org-super-agenda-header-map "j" #'org-agenda-next-line)
  (define-key org-super-agenda-header-map "k" #'org-agenda-previous-line))

(map! :leader
      ;; Calendar — bind SPC o c directly (simpler than :prefix wrapper).
      :desc "Calfw month calendar" "o c" #'calfw-org-open-calendar

      ;; Custom agenda dashboards
      (:prefix-map ("A" . "agenda dashboards")
       :desc "Daily"     "D" (cmd! (org-agenda nil "D"))
       :desc "Weekly"    "W" (cmd! (org-agenda nil "W"))
       :desc "Monthly"   "M" (cmd! (org-agenda nil "M"))
       :desc "Quarterly" "Q" (cmd! (org-agenda nil "Q"))
       :desc "Annual"    "Y" (cmd! (org-agenda nil "Y")))

      ;; Captures (X for eXpress capture, to avoid collision with notes)
      (:prefix-map ("X" . "capture")
       :desc "Inbox task"        "i" (cmd! (org-capture nil "i"))
       :desc "Someday / maybe"   "s" (cmd! (org-capture nil "s"))
       :desc "Weekly review"     "w" #'life-os/open-weekly-review
       :desc "Monthly review"    "m" #'life-os/open-monthly-review
       :desc "Quarterly review"  "q" #'life-os/open-quarterly-review
       :desc "Annual review"     "y" #'life-os/open-annual-review))

;; ──────────────────────────────────────────────────────────
;; Olivetti — centered writing column for org buffers
;; ──────────────────────────────────────────────────────────
(use-package! olivetti
  :hook (org-mode . olivetti-mode)
  :init
  (setq-default olivetti-body-width 0.65        ; 65% of frame width
                olivetti-minimum-body-width 80  ; never narrower than this
                olivetti-style nil))

;; ──────────────────────────────────────────────────────────
;; Disable line numbers in org-mode and the agenda.
;; Doom's global default is `t`; this overrides for those modes only.
;; ──────────────────────────────────────────────────────────
(add-hook! '(org-mode-hook org-agenda-mode-hook)
  (defun life-os/disable-line-numbers ()
    (display-line-numbers-mode -1)))

;; ──────────────────────────────────────────────────────────
