doom/config.el
;; Inline LaTeX preview — size and color.
;;
;; Each formula is hashed and rendered to a PNG cached under
;; `ltximg/' next to the org file. When options change, NEW formulas
;; pick up the new settings, but existing PNGs are reused. To force
;; everything to re-render, blow away the cache:
;;     M-x life-os/clear-latex-previews
;; then C-c C-x C-l once on the buffer to regenerate.
;; ──────────────────────────────────────────────────────────
(after! org
  (setq org-format-latex-options
        (plist-put org-format-latex-options :scale 1.0))      ; size
  (setq org-format-latex-options
        (plist-put org-format-latex-options :foreground "#b7bdf8")) ; lavender
  (setq org-format-latex-options
        (plist-put org-format-latex-options :background 'default)))

(defun life-os/clear-latex-previews ()
  "Delete cached LaTeX preview PNGs for the current org file."
  (interactive)
  (let* ((dir (expand-file-name "ltximg" default-directory)))
    (when (file-directory-p dir)
      (delete-directory dir t)
      (message "Cleared LaTeX preview cache at %s" dir))))

;; ──────────────────────────────────────────────────────────
;; Center display-math LaTeX previews (\\[…\\], $$…$$, \\begin{…}).
;; Inline math ($…$, \\(…\\)) is left alone.
;;
;; Org renders each formula to a PNG and shows it as an overlay at
;; the formula's location. To "center" the result we add a
;; `before-string' with `display' = (space :width PX) where PX is
;; half the leftover horizontal pixels in the window.
;; ──────────────────────────────────────────────────────────
(defun life-os/--center-org-latex-displays (&rest _)
  "Add a centering pad to display-math LaTeX preview overlays."
  (when (derived-mode-p 'org-mode)
    (dolist (ov (overlays-in (point-min) (point-max)))
      (when (eq (overlay-get ov 'org-overlay-type) 'org-latex-overlay)
        (let ((display (overlay-get ov 'display)))
          (when (and (consp display) (eq (car display) 'image))
            (save-excursion
              (goto-char (overlay-start ov))
              (when (looking-at-p
                     "[ \t]*\\(\\\\\\[\\|\\$\\$\\|\\\\begin{\\)")
                (let* ((img-w (car (image-size display t)))
                       (win-w (window-pixel-width))
                       (pad   (max 0 (/ (- win-w img-w) 2))))
                  (overlay-put ov 'before-string
                               (propertize
                                " " 'display
                                `(space :width (,pad)))))))))))))

(advice-add 'org-toggle-latex-fragment
            :after #'life-os/--center-org-latex-displays)
(advice-add 'org-latex-preview
            :after #'life-os/--center-org-latex-displays)

;; ──────────────────────────────────────────────────────────
;; Theme — Catppuccin Macchiato (matches Obsidian AnuPpuccin)
;;
;; catppuccin-flavor MUST be set before the theme is loaded.
;; Switch flavor later with: (setq catppuccin-flavor 'mocha)
;; then M-x catppuccin-reload.
;; Available flavors: 'latte (light) / 'frappe / 'macchiato / 'mocha (dark)
;; ──────────────────────────────────────────────────────────
(setq catppuccin-flavor 'macchiato)
(setq doom-theme 'catppuccin)

;; ──────────────────────────────────────────────────────────
;; Fonts — JetBrainsMono NFM everywhere
;; ──────────────────────────────────────────────────────────
;; doom-font           — primary monospace face
;; doom-variable-pitch — used for prose (set to mono on purpose, per user pref)
;; doom-serif-font     — used by some org faces; same family for consistency
(setq doom-font            (font-spec :family "JetBrainsMono NFM" :size 16 :weight 'regular)
      doom-variable-pitch-font (font-spec :family "JetBrainsMono NFM" :size 16)
      doom-serif-font    (font-spec :family "JetBrainsMono NFM" :size 16 :weight 'regular))

;; Small UI niceties
(setq-default line-spacing 0.15)

;; ──────────────────────────────────────────────────────────
;; org-modern — modern visual styling for org-mode
;; ──────────────────────────────────────────────────────────
(use-package! org-modern
  :after org
  :hook (org-mode . org-modern-mode)
  :hook (org-agenda-finalize . org-modern-agenda)
  :config
  (setq org-modern-star      ["◉" "○" "✸" "✿" "✤" "✜" "◆"]
        org-modern-list      '((?- . "•") (?+ . "‣") (?* . "▸"))
        org-modern-checkbox  '((?X . "☑") (?- . "▣") (?\s . "☐"))
        org-modern-table-vertical 1
        org-modern-table-horizontal 0.2
        org-modern-block-fringe nil
        ;; Catppuccin Macchiato palette
        ;;   green #a6da95   blue #8aadf4   yellow #eed49f
        ;;   red   #ed8796   overlay0 #6e738d
        org-modern-todo-faces
        '(("TODO" :foreground "#a6da95" :weight bold)   ; green
          ("STRT" :foreground "#8aadf4" :weight bold)   ; blue
          ("WAIT" :foreground "#eed49f" :weight bold)   ; yellow
          ("DONE" :foreground "#6e738d" :weight normal) ; muted
          ("KILL" :foreground "#ed8796" :weight bold)))) ; red

;; Larger, heavier headings in org files for visual hierarchy.
;;
;; Org uses `org-level-1' … `org-level-8' for headlines (they nominally
;; inherit from outline-*, but Catppuccin and most themes set
;; org-level-* directly, which breaks the inheritance). So we override
;; those specifically. Available weights, lightest → heaviest:
;;   regular medium semi-bold bold extra-bold black ultra-bold
;; JetBrainsMono NFM ships all of them as real font weights.
(custom-set-faces!
  '(org-document-title :height 1.8  :weight black)
  '(org-level-1        :height 1.5  :weight extra-bold)
  '(org-level-2        :height 1.3  :weight extra-bold)
  '(org-level-3        :height 1.15 :weight extra-bold)
  '(org-level-4        :height 1.05 :weight bold)
  ;; Keep outline-* in sync for non-org buffers that use them.
  '(outline-1          :height 1.5  :weight extra-bold)
  '(outline-2          :height 1.3  :weight extra-bold)
  '(outline-3          :height 1.15 :weight extra-bold)
  '(outline-4          :height 1.05 :weight bold))

;; ──────────────────────────────────────────────────────────
;; Org table styling.
;;
;; Catppuccin sets `org-table' foreground to a muted color (and so do
;; most themes), making cell text harder to read than body text. Force
;; the bright Macchiato text color (#cad3f5) explicitly.
;;
;; Org has no built-in "first row is a header" face for the in-buffer
;; display (the `org-table-header' face only affects the window's
;; sticky header line, not the visible row). For headers, use bold
;; markers — *Header text* — and our mauve bold accent will style them.
;; ──────────────────────────────────────────────────────────
(custom-set-faces!
  '(org-table :foreground "#cad3f5"))

;; ──────────────────────────────────────────────────────────
;; Accent color for bold and italic — Catppuccin mauve (#c6a0f6).
;;
;; Setting :foreground only (no :weight / :slant override) preserves
;; the existing bold weight / italic slant — we just tint the color.
;; Affects ALL bold/italic in Emacs, not just org — mauve is gentle
;; enough that UI elements still look correct.
;; ──────────────────────────────────────────────────────────
(custom-set-faces!
  '(bold   :foreground "#c6a0f6")
  '(italic :foreground "#c6a0f6"))

;; ──────────────────────────────────────────────────────────
