doom/config.el
;; Finance directory + main journal
;; ──────────────────────────────────────────────────────────
(defvar life-os/finance-directory (file-truename "~/finance/")
  "Root directory for hledger journals.")

(defvar life-os/finance-main-journal
  (expand-file-name "main.journal" life-os/finance-directory)
  "Top-level hledger journal (includes the per-year files).")

;; ──────────────────────────────────────────────────────────
;; ledger-mode → hledger
;;
;; ledger-mode targets the `ledger' CLI by default; point it at the
;; `hledger' binary instead. `ledger-mode-should-check-version' is
;; disabled because that check only understands ledger's --version.
;; ──────────────────────────────────────────────────────────
(after! ledger-mode
  (setq ledger-binary-path "hledger"
        ledger-mode-should-check-version nil
        ;; Open report buffers in a side window, keep the journal visible.
        ledger-report-links-in-same-window nil
        ;; Re-align postings to this column on `ledger-post-align-postings'.
        ledger-post-amount-alignment-column 60)

  ;; Tell ledger-mode where the whole-ledger lives, so reports invoked
  ;; from any journal buffer operate over the full file set.
  (setenv "LEDGER_FILE" life-os/finance-main-journal))

;; hledger uses the .journal extension; also map the .hledger extension.
(add-to-list 'auto-mode-alist '("\\.journal\\'" . ledger-mode))
(add-to-list 'auto-mode-alist '("\\.hledger\\'" . ledger-mode))

;; ──────────────────────────────────────────────────────────
;; Open the main journal — SPC o f
;; ──────────────────────────────────────────────────────────
(defun life-os/open-finance-journal ()
  "Open the top-level hledger journal."
  (interactive)
  (find-file life-os/finance-main-journal))

(map! :leader
      :desc "Finance journal" "o f" #'life-os/open-finance-journal)

;; ──────────────────────────────────────────────────────────
;; Roam graph — SPC n r g
;;
;; Doom binds SPC n r g to `org-roam-graph', which shells out to the
;; Graphviz `dot' binary (not installed here) to render a static SVG.
;; We use org-roam-ui instead — an in-browser, live, interactive graph
;; that needs no external executable — so repoint the same key to it.
;; ──────────────────────────────────────────────────────────
(map! :leader
      :desc "Roam graph (UI)" "n r g" #'org-roam-ui-open)
